keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCpu_regdef.h
/** \\brief  Program Control 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CPU_PCON0_Bits B;
} Ifx_CPU_PCON0;

/** \\brief  Program Control 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CPU_PCON1_Bits B;
} Ifx_CPU_PCON1;

/** \\brief  Program Control 2 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CPU_PCON2_Bits B;
} Ifx_CPU_PCON2;

/** \\brief  Previous Context Information Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CPU_PCXI_Bits B;
} Ifx_CPU_PCXI;

/** \\brief  Program Integrity Error Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CPU_PIEAR_Bits B;
} Ifx_CPU_PIEAR;

/** \\brief  Program Integrity Error Trap Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CPU_PIETR_Bits B;
} Ifx_CPU_PIETR;

/** \\brief  Data Access CacheabilityRegister */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CPU_PMA0_Bits B;
} Ifx_CPU_PMA0;

/** \\brief  Code Access CacheabilityRegister */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CPU_PMA1_Bits B;
} Ifx_CPU_PMA1;

/** \\brief  Peripheral Space Identifier register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CPU_PMA2_Bits B;
} Ifx_CPU_PMA2;

/** \\brief  Program Synchronous Trap Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CPU_PSTR_Bits B;
} Ifx_CPU_PSTR;

/** \\brief  Program Status Word */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CPU_PSW_Bits B;
} Ifx_CPU_PSW;

/** \\brief  SRI Error Generation Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CPU_SEGEN_Bits B;
} Ifx_CPU_SEGEN;

/** \\brief  SIST Mode Access Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CPU_SMACON_Bits B;
} Ifx_CPU_SMACON;

/** \\brief  CPU Safety Protection Register Access Enable Register A */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CPU_SPROT_ACCENA_Bits B;
} Ifx_CPU_SPROT_ACCENA;

/** \\brief  CPU Safety Protection Region Access Enable Register B */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CPU_SPROT_ACCENB_Bits B;
} Ifx_CPU_SPROT_ACCENB;

/** \\brief  CPU Safety Protection Region Access Enable Register A */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CPU_SPROT_RGN_ACCENA_Bits B;
} Ifx_CPU_SPROT_RGN_ACCENA;

/** \\brief  CPU Safety Protection Region Access Enable Register B */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CPU_SPROT_RGN_ACCENB_Bits B;
} Ifx_CPU_SPROT_RGN_ACCENB;

/** \\brief  CPU Safety Protection Region Lower Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CPU_SPROT_RGN_LA_Bits B;
} Ifx_CPU_SPROT_RGN_LA;

/** \\brief  CPU Safety protection Region Upper Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CPU_SPROT_RGN_UA_Bits B;
} Ifx_CPU_SPROT_RGN_UA;

/** \\brief  Software Debug Event */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CPU_SWEVT_Bits B;
} Ifx_CPU_SWEVT;

/** \\brief  System Configuration Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CPU_SYSCON_Bits B;
} Ifx_CPU_SYSCON;

/** \\brief  CPU Task Address Space Identifier Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CPU_TASK_ASI_Bits B;
} Ifx_CPU_TASK_ASI;

/** \\brief  CPU Temporal Protection System Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CPU_TPS_CON_Bits B;
} Ifx_CPU_TPS_CON;

/** \\brief  CPU Temporal Protection System Timer Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CPU_TPS_TIMER_Bits B;
} Ifx_CPU_TPS_TIMER;

/** \\brief  Trigger Address */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CPU_TR_ADR_Bits B;
} Ifx_CPU_TR_ADR;

/** \\brief  Trigger Event */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CPU_TR_EVT_Bits B;
} Ifx_CPU_TR_EVT;

