keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCpu_regdef.h
/** \\brief  CPU Trigger Address x */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CPU_TRIG_ACC_Bits B;
} Ifx_CPU_TRIG_ACC;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Cpu_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */

/** \\brief  Protection range */
typedef volatile struct _Ifx_CPU_CPR
{
    Ifx_CPU_CPR_L L;                        /**< \brief 0, CPU Code Protection Range Lower Bound Register */
    Ifx_CPU_CPR_U U;                        /**< \brief 4, CPU Code Protection Range Upper Bound Register */
} Ifx_CPU_CPR;

/** \\brief  Protection range */
typedef volatile struct _Ifx_CPU_DPR
{
    Ifx_CPU_DPR_L L;                        /**< \brief 0, CPU Data Protection Range, Lower Bound Register */
    Ifx_CPU_DPR_U U;                        /**< \brief 4, CPU Data Protection Range, Upper Bound Register */
} Ifx_CPU_DPR;

/** \\brief  Safety protection region */
typedef volatile struct _Ifx_CPU_SPROT_RGN
{
    Ifx_CPU_SPROT_RGN_LA LA;                /**< \brief 0, CPU Safety Protection Region Lower Address Register */
    Ifx_CPU_SPROT_RGN_UA UA;                /**< \brief 4, CPU Safety protection Region Upper Address Register */
    Ifx_CPU_SPROT_RGN_ACCENA ACCENA;        /**< \brief 8, CPU Safety Protection Region Access Enable Register A */
    Ifx_CPU_SPROT_RGN_ACCENB ACCENB;        /**< \brief C, CPU Safety Protection Region Access Enable Register B */
} Ifx_CPU_SPROT_RGN;

/** \\brief  Temporal Protection System */
typedef volatile struct _Ifx_CPU_TPS
{
    Ifx_CPU_TPS_CON CON;                    /**< \brief 0, CPU Temporal Protection System Control Register */
    Ifx_CPU_TPS_TIMER TIMER[3];             /**< \brief 4, CPU Temporal Protection System Timer Register */
} Ifx_CPU_TPS;

/** \\brief  Trigger */
typedef volatile struct _Ifx_CPU_TR
{
    Ifx_CPU_TR_EVT EVT;                     /**< \brief 0, Trigger Event  */
    Ifx_CPU_TR_ADR ADR;                     /**< \brief 4, Trigger Address  */
} Ifx_CPU_TR;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Cpu_struct
 * \{  */
/******************************************************************************/
/** \name Object L0
 * \{  */

/** \\brief  CPU object */
typedef volatile struct _Ifx_CPU
{
    unsigned char reserved_0[4144];         /**< \brief 0, \internal Reserved */
    Ifx_CPU_SEGEN SEGEN;                    /**< \brief 1030, SRI Error Generation Register */
    unsigned char reserved_1034[28624];     /**< \brief 1034, \internal Reserved */
    Ifx_CPU_TASK_ASI TASK_ASI;              /**< \brief 8004, CPU Task Address Space Identifier Register */
    unsigned char reserved_8008[248];       /**< \brief 8008, \internal Reserved */
    Ifx_CPU_PMA0 PMA0;                      /**< \brief 8100, Data Access CacheabilityRegister */
    Ifx_CPU_PMA1 PMA1;                      /**< \brief 8104, Code Access CacheabilityRegister */
    Ifx_CPU_PMA2 PMA2;                      /**< \brief 8108, Peripheral Space Identifier register */
    unsigned char reserved_810C[3828];      /**< \brief 810C, \internal Reserved */
    Ifx_CPU_DCON2 DCON2;                    /**< \brief 9000, Data Control Register 2 */
    unsigned char reserved_9004[8];         /**< \brief 9004, \internal Reserved */
    Ifx_CPU_SMACON SMACON;                  /**< \brief 900C, SIST Mode Access Control Register */
    Ifx_CPU_DSTR DSTR;                      /**< \brief 9010, Data Synchronous Trap Register */
    unsigned char reserved_9014[4];         /**< \brief 9014, \internal Reserved */
    Ifx_CPU_DATR DATR;                      /**< \brief 9018, Data Asynchronous Trap Register */
    Ifx_CPU_DEADD DEADD;                    /**< \brief 901C, Data Error Address Register */
    Ifx_CPU_DIEAR DIEAR;                    /**< \brief 9020, Data Integrity Error Address Register */
    Ifx_CPU_DIETR DIETR;                    /**< \brief 9024, Data Integrity Error Trap Register */
    unsigned char reserved_9028[24];        /**< \brief 9028, \internal Reserved */
    Ifx_CPU_DCON0 DCON0;                    /**< \brief 9040, Data Memory Control Register */
    unsigned char reserved_9044[444];       /**< \brief 9044, \internal Reserved */
    Ifx_CPU_PSTR PSTR;                      /**< \brief 9200, Program Synchronous Trap Register */
    Ifx_CPU_PCON1 PCON1;                    /**< \brief 9204, Program Control 1 */
    Ifx_CPU_PCON2 PCON2;                    /**< \brief 9208, Program Control 2 */
    Ifx_CPU_PCON0 PCON0;                    /**< \brief 920C, Program Control 0 */
    Ifx_CPU_PIEAR PIEAR;                    /**< \brief 9210, Program Integrity Error Address Register */
    Ifx_CPU_PIETR PIETR;                    /**< \brief 9214, Program Integrity Error Trap Register */
    unsigned char reserved_9218[488];       /**< \brief 9218, \internal Reserved */
    Ifx_CPU_COMPAT COMPAT;                  /**< \brief 9400, Compatibility Control Register */
    unsigned char reserved_9404[3068];      /**< \brief 9404, \internal Reserved */
    Ifx_CPU_FPU_TRAP_CON FPU_TRAP_CON;      /**< \brief A000, CPU Trap Control Register */
    Ifx_CPU_FPU_TRAP_PC FPU_TRAP_PC;        /**< \brief A004, CPU Trapping Instruction Program Counter Register */
    Ifx_CPU_FPU_TRAP_OPC FPU_TRAP_OPC;      /**< \brief A008, CPU Trapping Instruction Opcode Register */
    unsigned char reserved_A00C[4];         /**< \brief A00C, \internal Reserved */
    Ifx_CPU_FPU_TRAP_SRC1 FPU_TRAP_SRC1;    /**< \brief A010, CPU Trapping Instruction Operand Register */
    Ifx_CPU_FPU_TRAP_SRC2 FPU_TRAP_SRC2;    /**< \brief A014, CPU Trapping Instruction Operand Register */
    Ifx_CPU_FPU_TRAP_SRC3 FPU_TRAP_SRC3;    /**< \brief A018, Trapping Instruction Operand Register */
    unsigned char reserved_A01C[8164];      /**< \brief A01C, \internal Reserved */
    Ifx_CPU_DPR DPR[16];                    /**< \brief C000, Protection range */
    unsigned char reserved_C080[3968];      /**< \brief C080, \internal Reserved */
    Ifx_CPU_CPR CPR[8];                     /**< \brief D000, Protection range */
    unsigned char reserved_D040[4032];      /**< \brief D040, \internal Reserved */
    Ifx_CPU_CPXE CPXE[4];                   /**< \brief E000, CPU Code Protection Execute Enable Register Set */
    Ifx_CPU_DPRE DPRE[4];                   /**< \brief E010, CPU Data Protection Read Enable Register Set */
    Ifx_CPU_DPWE DPWE[4];                   /**< \brief E020, CPU Data Protection Write Enable Register Set */
    unsigned char reserved_E030[976];       /**< \brief E030, \internal Reserved */
    Ifx_CPU_TPS TPS;                        /**< \brief E400, Temporal Protection System */
    unsigned char reserved_E410[3056];      /**< \brief E410, \internal Reserved */
    Ifx_CPU_TR TR[8];                       /**< \brief F000, Trigger */
    unsigned char reserved_F040[3008];      /**< \brief F040, \internal Reserved */
    Ifx_CPU_CCTRL CCTRL;                    /**< \brief FC00, Counter Control */
    Ifx_CPU_CCNT CCNT;                      /**< \brief FC04, CPU Clock Cycle Count */
    Ifx_CPU_ICNT ICNT;                      /**< \brief FC08, Instruction Count */
    Ifx_CPU_M1CNT M1CNT;                    /**< \brief FC0C, Multi-Count Register 1 */
    Ifx_CPU_M2CNT M2CNT;                    /**< \brief FC10, Multi-Count Register 2 */
    Ifx_CPU_M3CNT M3CNT;                    /**< \brief FC14, Multi-Count Register 3 */
    unsigned char reserved_FC18[232];       /**< \brief FC18, \internal Reserved */
    Ifx_CPU_DBGSR DBGSR;                    /**< \brief FD00, Debug Status Register */
    unsigned char reserved_FD04[4];         /**< \brief FD04, \internal Reserved */
    Ifx_CPU_EXEVT EXEVT;                    /**< \brief FD08, External Event Register */
    Ifx_CPU_CREVT CREVT;                    /**< \brief FD0C, Core Register Access Event */
    Ifx_CPU_SWEVT SWEVT;                    /**< \brief FD10, Software Debug Event */
    unsigned char reserved_FD14[28];        /**< \brief FD14, \internal Reserved */
    Ifx_CPU_TRIG_ACC TRIG_ACC;              /**< \brief FD30, CPU Trigger Address x */
    unsigned char reserved_FD34[12];        /**< \brief FD34, \internal Reserved */
    Ifx_CPU_DMS DMS;                        /**< \brief FD40, CPU Debug Monitor Start Address */
    Ifx_CPU_DCX DCX;                        /**< \brief FD44, CPU Debug Context Save Area Pointer */
    Ifx_CPU_DBGTCR DBGTCR;                  /**< \brief FD48, Debug Trap Control Register */
    unsigned char reserved_FD4C[180];       /**< \brief FD4C, \internal Reserved */
    Ifx_CPU_PCXI PCXI;                      /**< \brief FE00, Previous Context Information Register */
    Ifx_CPU_PSW PSW;                        /**< \brief FE04, Program Status Word */
    Ifx_CPU_PC PC;                          /**< \brief FE08, Program Counter */
    unsigned char reserved_FE0C[8];         /**< \brief FE0C, \internal Reserved */
    Ifx_CPU_SYSCON SYSCON;                  /**< \brief FE14, System Configuration Register */
    Ifx_CPU_CPU_ID CPU_ID;                  /**< \brief FE18, CPU Identification Register TC1.6P */
    Ifx_CPU_CORE_ID CORE_ID;                /**< \brief FE1C, CPU Core Identification Register */
    Ifx_CPU_BIV BIV;                        /**< \brief FE20, Base Interrupt Vector Table Pointer */
    Ifx_CPU_BTV BTV;                        /**< \brief FE24, Base Trap Vector Table Pointer */
    Ifx_CPU_ISP ISP;                        /**< \brief FE28, Interrupt Stack Pointer */
    Ifx_CPU_ICR ICR;                        /**< \brief FE2C, Interrupt Control Register */
    unsigned char reserved_FE30[8];         /**< \brief FE30, \internal Reserved */
    Ifx_CPU_FCX FCX;                        /**< \brief FE38, Free CSA List Head Pointer */
    Ifx_CPU_LCX LCX;                        /**< \brief FE3C, Free CSA List Limit Pointer */
    unsigned char reserved_FE40[16];        /**< \brief FE40, \internal Reserved */
    Ifx_CPU_CUS_ID CUS_ID;                  /**< \brief FE50, CPU Customer ID register */
    unsigned char reserved_FE54[172];       /**< \brief FE54, \internal Reserved */
    Ifx_CPU_D D[16];                        /**< \brief FF00, Data General Purpose Register */
    unsigned char reserved_FF40[64];        /**< \brief FF40, \internal Reserved */
    Ifx_CPU_A A[16];                        /**< \brief FF80, Address General Purpose Register */
    unsigned char reserved_FFC0[64];        /**< \brief FFC0, \internal Reserved */
} Ifx_CPU;

/** \\brief  CPU SPROT object */
typedef volatile struct _Ifx_CPU_SPROT
{
    unsigned char reserved_0[57344];        /**< \brief 0, \internal Reserved */
    Ifx_CPU_SPROT_RGN RGN[8];               /**< \brief E000, Safety protection region */
    unsigned char reserved_E080[128];       /**< \brief E080, \internal Reserved */
    Ifx_CPU_SPROT_ACCENA ACCENA;            /**< \brief E100, CPU Safety Protection Register Access Enable Register A */
    Ifx_CPU_SPROT_ACCENB ACCENB;            /**< \brief E104, CPU Safety Protection Region Access Enable Register B */
    unsigned char reserved_E108[7928];      /**< \brief E108, \internal Reserved */
} Ifx_CPU_SPROT;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXCPU_REGDEF_H */
